#include "config.h"
#include "GPIO.h"
#include "Delay.h"
#include "Buzzer.h"

/****************
手动驱动蜂鸣器
****************/

// 音调序列 (1-7 对应 do-si)
u8 code notes[] = {
	3, 5, 6, 3, 5, 6, 3,         // 听说白雪公主在逃跑
	2, 3, 1, 2, 3,               // 小红帽在担心
	3, 5, 6, 3, 5, 6, 3,         // 听说疯帽喜欢爱丽丝
	2, 3, 1, 2, 1,               // 大家都爱他
	
	5, 5, 6, 5, 3, 2, 1,         // 某个秘密就要公开
	1, 1, 2, 3, 5,               // 红鞋子不见了
	3, 5, 6, 3, 5, 6, 3,         // 灰姑娘的水晶鞋
	2, 3, 1, 2, 1                // 丢了一只还在跑
};

// 时值序列 (单位: 100ms)
u8 code durations[] = {
	2, 2, 2, 2, 2, 2, 4,         // 第一句时值
	2, 2, 2, 2, 4,               // 第二句时值
	2, 2, 2, 2, 2, 2, 4,         // 第三句时值
	2, 2, 2, 2, 4,               // 第四句时值
	
	2, 2, 2, 2, 2, 2, 4,         // 第五句时值
	2, 2, 2, 2, 4,               // 第六句时值
	2, 2, 2, 2, 2, 2, 4,         // 第七句时值
	2, 2, 2, 2, 4                // 第八句时值
};


// 初始化GPIO
void main() {
	u8 i = 0, len = 0;
	u16 delay;
	// 扩展寄存器使能
	EAXSFR(); 
	Buzzer_init();
  EA = 1;
	
	len = sizeof(notes) / sizeof(notes[0]);
	
	for(i = 0; i < len; i++){
		// 按照指定音调输出
		Buzzer_beep(notes[i]);
		
		// 根据每个音调进行休眠
		delay = durations[i] * 100;
		delay_X_ms(delay);
		
		// 短暂的间隔
		Buzzer_stop();
		delay_ms(20);
	}
	
	// 停止
	Buzzer_stop();
	
  while(1) {

  }
}